## Plan Result (demo_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 138 to add, 0 to change, 138 to destroy.</code></pre>

* Create
  * module.landing_zone[0].azurerm_frontdoor.main
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;ac-int-gateway-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;adoption-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;bar&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;bar-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cft-api-mgmt&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;civil-citizen-ui&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cmc&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-et1&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-et3&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;help-with-fees-staffapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;ia-aip&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;lau-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;pcq-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;plum&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;plum-public&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;privatelaw&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;reformscan&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;tax-tribunals-datacapture&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-ac-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-caa-ac&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-hearings-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-int1&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-int2&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-srt&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-wa-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;ac-int-gateway-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;adoption-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;bar&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;bar-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;civil-citizen-ui&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cmc&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-da&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-dn&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-pfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-rfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;dss-update-case&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-et1&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-et3&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fact&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fees-register-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fis-ds-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-staffapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;ia-aip&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;lau&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;lau-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;paybubble&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;paybubble-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;pcq&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;pcq-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;plum-public&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;privatelaw&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;rpts&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sptribs-frontend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sscs-cor&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tribunals&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;tax-tribunals-datacapture&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-register-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-ac-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-caa-ac&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-hearings-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-int&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-int1&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-int2&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-srt&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-wa-int&#34;]
  * module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0]
* Delete
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ac-int-gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;adoption-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;civil-citizen-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-et1&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-et3&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;help-with-fees-staffapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;plum-public&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;tax-tribunals-datacapture&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-ac-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-caa-ac&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-hearings-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-int1&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-int2&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-srt&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp-wa-int&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;ac-int-gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;adoption-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;bar&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;bar-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;civil-citizen-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dss-update-case&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-et1&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-et3&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fees-register-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-staffapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;lau-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paybubble-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pcq-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;rpts&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;tax-tribunals-datacapture&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-ac-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-caa-ac&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-hearings-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-int&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-int1&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-int2&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-srt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp-wa-int&#34;]
  * module.landing_zone.azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.landing_zone.azurerm_role_assignment.frontdoor_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_frontdoor" "main" {
      - backend_pool_health_probes           = {
          - "defaultHealthProbe"                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/defaultHealthProbe"
          - "healthProbeSettings-ac-int-gateway-ccd"        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-ac-int-gateway-ccd"
          - "healthProbeSettings-adoption-web"              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-adoption-web"
          - "healthProbeSettings-bar"                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-bar"
          - "healthProbeSettings-bar-int"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-bar-int"
          - "healthProbeSettings-cft-api-mgmt"              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-cft-api-mgmt"
          - "healthProbeSettings-civil-citizen-ui"          = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-civil-citizen-ui"
          - "healthProbeSettings-cmc"                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-cmc"
          - "healthProbeSettings-div-da"                    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-div-da"
          - "healthProbeSettings-div-dn"                    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-div-dn"
          - "healthProbeSettings-div-pfe"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-div-pfe"
          - "healthProbeSettings-div-rfe"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-div-rfe"
          - "healthProbeSettings-dss-update-case"           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-dss-update-case"
          - "healthProbeSettings-et-pet-admin"              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-et-pet-admin"
          - "healthProbeSettings-et-pet-et1"                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-et-pet-et1"
          - "healthProbeSettings-et-pet-et3"                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-et-pet-et3"
          - "healthProbeSettings-et-sya"                    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-et-sya"
          - "healthProbeSettings-fact"                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fact"
          - "healthProbeSettings-fact-admin"                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fact-admin"
          - "healthProbeSettings-fees-register"             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fees-register"
          - "healthProbeSettings-fees-register-int"         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fees-register-int"
          - "healthProbeSettings-fis-ds-web"                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-fis-ds-web"
          - "healthProbeSettings-gateway-ccd"               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-gateway-ccd"
          - "healthProbeSettings-gateway-ccd-int"           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-gateway-ccd-int"
          - "healthProbeSettings-help-with-fees-publicapp"  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-help-with-fees-publicapp"
          - "healthProbeSettings-help-with-fees-staffapp"   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-help-with-fees-staffapp"
          - "healthProbeSettings-hmcts-access"              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-hmcts-access"
          - "healthProbeSettings-hmi-apim"                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-hmi-apim"
          - "healthProbeSettings-ia-aip"                    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-ia-aip"
          - "healthProbeSettings-idam-user-dashboard"       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-idam-user-dashboard"
          - "healthProbeSettings-idam-web-admin"            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-idam-web-admin"
          - "healthProbeSettings-idam-web-public"           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-idam-web-public"
          - "healthProbeSettings-lau"                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-lau"
          - "healthProbeSettings-lau-int"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-lau-int"
          - "healthProbeSettings-nfdiv"                     = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-nfdiv"
          - "healthProbeSettings-paybubble"                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-paybubble"
          - "healthProbeSettings-paybubble-int"             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-paybubble-int"
          - "healthProbeSettings-paymentoutcome-web"        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-paymentoutcome-web"
          - "healthProbeSettings-paymentoutcome-web-int"    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-paymentoutcome-web-int"
          - "healthProbeSettings-pcq"                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-pcq"
          - "healthProbeSettings-pcq-int"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-pcq-int"
          - "healthProbeSettings-plum"                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-plum"
          - "healthProbeSettings-plum-public"               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-plum-public"
          - "healthProbeSettings-privatelaw"                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-privatelaw"
          - "healthProbeSettings-probate"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-probate"
          - "healthProbeSettings-reformscan"                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-reformscan"
          - "healthProbeSettings-return-case-doc-ccd"       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-return-case-doc-ccd"
          - "healthProbeSettings-return-case-doc-ccd-int"   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-return-case-doc-ccd-int"
          - "healthProbeSettings-rpts"                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-rpts"
          - "healthProbeSettings-sptribs-frontend"          = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-sptribs-frontend"
          - "healthProbeSettings-sscs-cor"                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-sscs-cor"
          - "healthProbeSettings-sscs-tribunals"            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-sscs-tribunals"
          - "healthProbeSettings-tax-tribunals-datacapture" = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-tax-tribunals-datacapture"
          - "healthProbeSettings-xui-approve-org"           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-approve-org"
          - "healthProbeSettings-xui-approve-org-int"       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-approve-org-int"
          - "healthProbeSettings-xui-manage-org"            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-manage-org"
          - "healthProbeSettings-xui-manage-org-int"        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-manage-org-int"
          - "healthProbeSettings-xui-register-org"          = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-register-org"
          - "healthProbeSettings-xui-webapp"                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp"
          - "healthProbeSettings-xui-webapp-ac-int"         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp-ac-int"
          - "healthProbeSettings-xui-webapp-caa-ac"         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp-caa-ac"
          - "healthProbeSettings-xui-webapp-hearings-int"   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp-hearings-int"
          - "healthProbeSettings-xui-webapp-int"            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp-int"
          - "healthProbeSettings-xui-webapp-int1"           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp-int1"
          - "healthProbeSettings-xui-webapp-int2"           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp-int2"
          - "healthProbeSettings-xui-webapp-srt"            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp-srt"
          - "healthProbeSettings-xui-webapp-wa-int"         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/healthProbeSettings/healthProbeSettings-xui-webapp-wa-int"
        } -> null
      - backend_pool_load_balancing_settings = {
          - "defaultLoadBalancing"                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/defaultLoadBalancing"
          - "loadBalancingSettings-ac-int-gateway-ccd"        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-ac-int-gateway-ccd"
          - "loadBalancingSettings-adoption-web"              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-adoption-web"
          - "loadBalancingSettings-bar"                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-bar"
          - "loadBalancingSettings-bar-int"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-bar-int"
          - "loadBalancingSettings-cft-api-mgmt"              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-cft-api-mgmt"
          - "loadBalancingSettings-civil-citizen-ui"          = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-civil-citizen-ui"
          - "loadBalancingSettings-cmc"                       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-cmc"
          - "loadBalancingSettings-div-da"                    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-div-da"
          - "loadBalancingSettings-div-dn"                    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-div-dn"
          - "loadBalancingSettings-div-pfe"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-div-pfe"
          - "loadBalancingSettings-div-rfe"                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-div-rfe"
          - "loadBalancingSettings-dss-update-case"           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/loadBalancingSettings/loadBalancingSettings-dss-update-case"
          - "loadBalancingSettings-et-pet-admin"              = "/subscriptions

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

uage"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "selection.anythingElse.language"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["tax-tribunals-datacapture"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "taxtribunalsdatacapturedemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_tax-tribunals-datacapture_session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookie_setting"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utma"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmb"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmc"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmz"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "authenticity_token"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "address_lookup_url"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "steps_closure_support_documents_form"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "steps_details_documents_upload_form"
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-approve-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiapproveorgdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-approve-org-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiapproveorgintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-manage-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuimanageorgdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-manage-org-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuimanageorgintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-register-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiregisterorgdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp-ac-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappacintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp-caa-ac"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappcaaacdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp-hearings-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebapphearingsintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp-int1"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappint1demo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp-int2"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappint2demo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp-srt"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappsrtdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp-wa-int"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappwaintdemo"
      + resource_group_name   = "lz-demo-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
      + object_id               = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0] will be created
  + resource "azurerm_role_assignment" "frontdoor_kv_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 138 to add, 0 to change, 138 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1776,"Program":"tfcmt","SHA1":"","Target":"demo_global","Vars":{}} -->